#include "strs.h"

/*******************************************************************************
 **清除缓存数据
 **支持结构体和数组
 ******************************************************************************/
void Strbufclr(void *pu8Address, u32 u32Count)
{
    u8 *pu8Addr = (u8 *)pu8Address;
    if(NULL == pu8Addr)
    {
        return;
    }
    while (u32Count--)
    {
        *pu8Addr++ = 0;
    }
}
/*******************************************************************************
 **将byte转成16进制字符串，中间用空格间隔开，可以用printf+%s打印
 **注意字符串输出空间大小是len*3+1
 ******************************************************************************/
void StrToHexs(u8 *BufIn,u8 *Outs,u8 len)
{
    u8 i,j=0;
    u8 hexs[16]={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
    for(i=0;i<len;i++){
        Outs[j+i]=hexs[BufIn[i]/16];
        Outs[j+i+1]=hexs[BufIn[i]%16];
        Outs[j+i+2]=' ';
        j=j+2;
    }
    
    
}



